{
  "common": {
    "name": "mqtt",
    "version": "3.0.4",
    "news": {
      "3.0.4": {
        "en": "BREAKING CHANGE: password is now stored encrypted, and so must be set anew after update!",
        "de": "BREAKING CHANGE: Passwort wird jetzt verschlüsselt gespeichert und muss daher nach Update neu gesetzt werden!",
        "ru": "ВАЖНОЕ ИЗМЕНЕНИЕ: пароль теперь хранится в зашифрованном виде, поэтому после обновления его необходимо установить заново!",
        "pt": "BREAKING CHANGE: a senha agora é armazenada criptografada e, portanto, deve ser definida novamente após a atualização!",
        "nl": "BAANBREKENDE VERANDERING: het wachtwoord wordt nu versleuteld opgeslagen en moet dus opnieuw worden ingesteld na de update!",
        "fr": "BREAKING CHANGE : le mot de passe est maintenant stocké crypté et doit donc être défini à nouveau après la mise à jour !",
        "it": "MODIFICA INTERNA: la password è ora memorizzata crittografata, quindi deve essere reimpostata dopo l'aggiornamento!",
        "es": "CAMBIO IMPORTANTE: ¡la contraseña ahora se almacena cifrada, por lo que debe configurarse de nuevo después de la actualización!",
        "pl": "ZŁAMANIE ZMIANY: hasło jest teraz przechowywane w postaci zaszyfrowanej, dlatego po aktualizacji należy je ustawić od nowa!",
        "zh-cn": "重大更改：密码现在以加密方式存储，因此必须在更新后重新设置！"
      },
      "2.7.4": {
        "en": "Update mqtt library dependency",
        "de": "Aktualisieren Sie die mqtt-Bibliotheksabhängigkeit",
        "ru": "Обновить зависимость библиотеки mqtt",
        "pt": "Atualizar a dependência da biblioteca mqtt",
        "nl": "Afhankelijkheid van mqtt-bibliotheek bijwerken",
        "fr": "Mettre à jour la dépendance de la bibliothèque mqtt",
        "it": "Aggiorna la dipendenza della libreria mqtt",
        "es": "Actualizar la dependencia de la biblioteca mqtt",
        "pl": "Zaktualizuj zależność biblioteki mqtt",
        "zh-cn": "更新 mqtt 库依赖"
      },
      "2.7.3": {
        "en": "Further optimization of automatic folder creation",
        "de": "Weitere Optimierung der automatischen Ordnererstellung",
        "ru": "Дальнейшая оптимизация автоматического создания папок",
        "pt": "Otimização adicional da criação automática de pastas",
        "nl": "Verdere optimalisatie van het automatisch aanmaken van mappen",
        "fr": "Optimisation supplémentaire de la création automatique de dossiers",
        "it": "Ulteriore ottimizzazione della creazione automatica delle cartelle",
        "es": "Optimización adicional de la creación automática de carpetas",
        "pl": "Dalsza optymalizacja automatycznego tworzenia folderów",
        "zh-cn": "进一步优化自动创建文件夹"
      },
      "2.7.2": {
        "en": "Optimize the automatic folder creation and allow to automatically overwrite these objects when needed",
        "de": "Optimieren Sie die automatische Ordnererstellung und lassen Sie diese Objekte bei Bedarf automatisch überschreiben",
        "ru": "Оптимизируйте автоматическое создание папок и разрешите автоматически перезаписывать эти объекты при необходимости.",
        "pt": "Otimize a criação automática de pastas e permita a substituição automática desses objetos quando necessário",
        "nl": "Optimaliseer het automatisch aanmaken van mappen en laat deze objecten automatisch overschrijven wanneer dat nodig is",
        "fr": "Optimisez la création automatique de dossiers et permettez d'écraser automatiquement ces objets en cas de besoin",
        "it": "Ottimizza la creazione automatica delle cartelle e consenti di sovrascrivere automaticamente questi oggetti quando necessario",
        "es": "Optimice la creación automática de carpetas y permita sobrescribir automáticamente estos objetos cuando sea necesario",
        "pl": "Zoptymalizuj automatyczne tworzenie folderów i pozwól na automatyczne nadpisywanie tych obiektów w razie potrzeby",
        "zh-cn": "优化自动创建文件夹并允许在需要时自动覆盖这些对象"
      },
      "2.7.0": {
        "en": "Prevent Client or server to overwrite the own info.connection state\nreplace # and + characters by _ when publishing a value because these characters are forbidden when publishing for most brokers",
        "de": "Client oder Server daran hindern, den eigenen info.connection-Status zu überschreiben\nErsetzen Sie die Zeichen # und + durch _, wenn Sie einen Wert veröffentlichen, da diese Zeichen bei der Veröffentlichung für die meisten Broker verboten sind",
        "ru": "Запретить клиенту или серверу перезаписывать собственное состояние info.connection\nзамените символы # и + на _ при публикации значения, потому что эти символы запрещены при публикации для большинства брокеров",
        "pt": "Impedir que o cliente ou servidor sobrescreva o próprio estado info.connection\nsubstitua os caracteres # e + por _ ao publicar um valor porque esses caracteres são proibidos ao publicar para a maioria dos corretores",
        "nl": "Voorkom dat Client of server de eigen info.connection-status overschrijft\nvervang # en + tekens door _ bij het publiceren van een waarde, omdat deze tekens bij het publiceren voor de meeste brokers verboden zijn",
        "fr": "Empêcher le client ou le serveur d'écraser son propre état d'info.connexion\nremplacer les caractères # et + par _ lors de la publication d'une valeur car ces caractères sont interdits lors de la publication pour la plupart des brokers",
        "it": "Impedisci al client o al server di sovrascrivere il proprio stato info.connection\nsostituire i caratteri # e + con _ quando si pubblica un valore perché questi caratteri sono vietati durante la pubblicazione per la maggior parte dei broker",
        "es": "Impedir que el cliente o el servidor sobrescriban el propio estado de info.connection\nreemplace los caracteres # y + por _ al publicar un valor porque estos caracteres están prohibidos al publicar para la mayoría de los corredores",
        "pl": "Uniemożliwić klientowi lub serwerowi nadpisanie własnego stanu połączenia informacji\nzamień znaki # i + na _ podczas publikowania wartości, ponieważ te znaki są zabronione podczas publikowania dla większości brokerów",
        "zh-cn": "防止客户端或服务器覆盖自己的 info.connection 状态\n发布值时用 _ 替换 # 和 + 字符，因为大多数经纪人发布时禁止使用这些字符"
      }
    },
    "title": "MQTT Broker/Client",
    "titleLang": {
      "en": "MQTT Broker/Client",
      "de": "MQTT Broker/Client",
      "ru": "Брокер MQTT/Клиент",
      "pt": "MQTT Broker/Cliente",
      "nl": "MQTT-makelaar/klant",
      "fr": "Courtier MQTT/Client",
      "it": "Broker/Cliente MQTT",
      "es": "Agente MQTT/Cliente",
      "pl": "Broker/klient MQTT",
      "zh-cn": "MQTT经纪人/客户"
    },
    "desc": {
      "en": "This adapter allows to send and receive MQTT messages from ioBroker and to be a broker",
      "de": "Adapter ermöglicht eine Kommunikation mit dem MQTT broker und kann auch selbst ein broker/server sein",
      "ru": "Драйвер позволяет подключатся к MQTT брокерам, а также самому выступать в роли брокера",
      "pt": "Este adaptador permite enviar e receber mensagens MQTT da ioBroker e ser um corretor",
      "nl": "Met deze adapter kunt u MQTT-berichten van ioBroker verzenden en ontvangen en makelaar worden",
      "fr": "Cet adaptateur permet d'envoyer et de recevoir des messages MQTT de ioBroker et d'être un courtier",
      "it": "Questo adattatore consente di inviare e ricevere messaggi MQTT da ioBroker e di essere un broker",
      "es": "Este adaptador permite enviar y recibir mensajes MQTT de ioBroker y ser un intermediario",
      "pl": "Ten adapter umożliwia wysyłanie i odbieranie wiadomości MQTT od ioBroker i brokera",
      "zh-cn": "该适配器允许从ioBroker发送和接收MQTT消息并成为代理"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "docs": {
      "en": "docs/en/mqtt.md",
      "ru": "docs/ru/mqtt.md"
    },
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "compact": true,
    "messagebox": true,
    "readme": "https://github.com/ioBroker/ioBroker.mqtt/blob/master/README.md",
    "loglevel": "info",
    "icon": "mqtt.png",
    "materialize": true,
    "keywords": [
      "notification",
      "MQTT",
      "message"
    ],
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.mqtt/master/admin/mqtt.png",
    "type": "protocols",
    "plugins": {
      "sentry": {
        "dsn": "https://40b55da1fb50459eab397fe8291e75fe@sentry.iobroker.net/91"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=3.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=4.0.10"
      }
    ],
    "tier": 2,
    "connectionType": "local",
    "dataSource": "push",
    "adminUI": {
      "config": "json"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Re-enter the password after Update!",
          "de": "Passwort muss nach dem Update erneut eingegeben werden!",
          "ru": "Повторно введите пароль после обновления!",
          "pt": "Digite novamente a senha após Atualizar!",
          "nl": "Voer het wachtwoord opnieuw in na Update!",
          "fr": "Entrez à nouveau le mot de passe après la mise à jour !",
          "it": "Reinserire la password dopo l'aggiornamento!",
          "es": "Vuelva a ingresar la contraseña después de ¡Actualizar!",
          "pl": "Wprowadź hasło ponownie po aktualizacji!",
          "zh-cn": "更新后重新输入密码！"
        },
        "text": {
          "en": "After installing this update the password needs to be re-entered in the Instance-Settings!",
          "de": "Nach der Installation dieses Updates muss das Passwort in den Instanz-Einstellungen neu eingegeben werden!",
          "ru": "После установки этого обновления необходимо заново ввести пароль в Instance-Settings!",
          "pt": "Depois de instalar esta atualização, a senha precisa ser reinserida nas configurações da instância!",
          "nl": "Na het installeren van deze update moet het wachtwoord opnieuw worden ingevoerd in de Instance-Settings!",
          "fr": "Après avoir installé cette mise à jour, le mot de passe doit être ressaisi dans les paramètres de l'instance !",
          "it": "Dopo aver installato questo aggiornamento, è necessario reinserire la password nelle impostazioni dell'istanza!",
          "es": "¡Después de instalar esta actualización, la contraseña debe volver a ingresarse en la Configuración de instancia!",
          "pl": "Po zainstalowaniu tej aktualizacji hasło należy ponownie wprowadzić w ustawieniach instancji!",
          "zh-cn": "安装此更新后，需要在实例设置中重新输入密码！"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "encryptedNative": [
    "pass"
  ],
  "protectedNative": [
    "pass"
  ],
  "native": {
    "type": "client",
    "clientId": "",
    "bind": "0.0.0.0",
    "port": 1883,
    "ssl": false,
    "rejectUnauthorized": true,
    "user": "",
    "pass": "",
    "url": "localhost",
    "patterns": "#",
    "onchange": true,
    "publishAllOnStart": true,
    "debug": false,
    "publish": "mqtt.0.*",
    "certPublic": "",
    "certPrivate": "",
    "certChained": "",
    "prefix": "",
    "forceCleanSession": "no",
    "sendAckToo": false,
    "sendStateObject": false,
    "webSocket": false,
    "maxTopicLength": 100,
    "publishOnSubscribe": true,
    "extraSet": false,
    "sendOnStartInterval": 2000,
    "sendInterval": 10,
    "keepalive": 1000,
    "reconnectPeriod": 10,
    "connectTimeout": 30,
    "persistent": false,
    "defaultQoS": 0,
    "retain": false,
    "retransmitInterval": 2000,
    "retransmitCount": 10,
    "storeClientsTime": 1440,
    "removePrefix": ""
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "connected client for MQTT",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
