{
  "common": {
    "name": "mqtt",
    "version": "4.0.4",
    "news": {
      "4.0.4": {
        "en": "lower loglevel for log messages about messages with unknown message IDs to info",
        "de": "niedrigeres Loglevel für Log-Meldungen über Meldungen mit unbekannten Message-IDs an info",
        "ru": "более низкий уровень журнала для сообщений журнала о сообщениях с неизвестными идентификаторами сообщений для информации",
        "pt": "nível de log mais baixo para mensagens de log sobre mensagens com IDs de mensagem desconhecidos para informações",
        "nl": "lager logniveau voor logberichten over berichten met onbekende bericht-ID's naar info",
        "fr": "niveau de journalisation inférieur pour les messages de journalisation concernant les messages avec des ID de message inconnus vers info",
        "it": "livello di registro inferiore per i messaggi di registro relativi a messaggi con ID messaggio sconosciuti alle informazioni",
        "es": "nivel de registro más bajo para registrar mensajes sobre mensajes con ID de mensajes desconocidos para información",
        "pl": "niższy poziom logowania dla komunikatów dziennika o wiadomościach z nieznanymi identyfikatorami wiadomości do informacji",
        "zh-cn": "较低的日志级别，用于将有关具有未知消息 ID 的消息的消息记录到 info"
      },
      "4.0.3": {
        "en": "Corrected publish states on start by client",
        "de": "Veröffentlichungsstatus beim Start durch den Client korrigiert",
        "ru": "Исправлены состояния публикации при запуске клиентом",
        "pt": "Estados de publicação corrigidos na inicialização pelo cliente",
        "nl": "Gecorrigeerde publicatiestatussen bij opstarten door klant",
        "fr": "États de publication corrigés au démarrage par le client",
        "it": "Corretti gli stati di pubblicazione all'avvio da parte del client",
        "es": "Estados de publicación corregidos al inicio por el cliente",
        "pl": "Poprawione stany publikowania przy starcie przez klienta",
        "zh-cn": "更正了客户端启动时的发布状态"
      },
      "4.0.2": {
        "en": "Added possibility to publish own states as client, additionally to `mqtt.x`",
        "de": "Möglichkeit hinzugefügt, eigene Zustände als Client zusätzlich zu `mqtt.x` zu veröffentlichen",
        "ru": "Добавлена возможность публиковать собственные состояния в качестве клиента, дополнительно к `mqtt.x`",
        "pt": "Adicionada a possibilidade de publicar estados próprios como cliente, além de `mqtt.x`",
        "nl": "Mogelijkheid toegevoegd om eigen staten als client te publiceren, aanvullend op `mqtt.x`",
        "fr": "Ajout de la possibilité de publier ses propres états en tant que client, en plus de `mqtt.x`",
        "it": "Aggiunta la possibilità di pubblicare i propri stati come client, in aggiunta a `mqtt.x`",
        "es": "Se agregó la posibilidad de publicar estados propios como cliente, además de `mqtt.x`",
        "pl": "Dodano możliwość publikowania własnych stanów jako klient, dodatkowo do `mqtt.x`",
        "zh-cn": "添加了将自己的状态作为客户端发布的可能性，除了 `mqtt.x`"
      },
      "4.0.1": {
        "en": "Fix Number detection for values",
        "de": "Nummernerkennung für Werte behoben",
        "ru": "Fix Определение числа для значений",
        "pt": "Corrigir detecção de número para valores",
        "nl": "Fix Nummerdetectie voor waarden",
        "fr": "Réparer Détection de nombre pour les valeurs",
        "it": "Correzione del rilevamento del numero per i valori",
        "es": "Arreglar la detección de números para valores.",
        "pl": "Wykrywanie numerów napraw dla wartości",
        "zh-cn": "修复值的数字检测"
      },
      "4.0.0": {
        "en": "BREAKING CHANGE: in client mode only \"mqtt.X.*\" states will be subscribed\nBREAKING CHANGE: in server mode by empty \"publish\" setting no states will be subscribed. Early all states were subscribed\nAdded new option: All new topics will be processed as binary",
        "de": "BREAKING CHANGE: Im Client-Modus werden nur \"mqtt.X.*\"-Zustände abonniert\nBREAKING CHANGE: im Servermodus werden bei leerer \"publish\"-Einstellung keine Zustände abonniert. Früh wurden alle Staaten abonniert\nNeue Option hinzugefügt: Alle neuen Themen werden als Binär verarbeitet",
        "ru": "ГЛАВНОЕ ИЗМЕНЕНИЕ: в клиентском режиме будут подписываться только состояния \"mqtt.X.*\"\nВАЖНОЕ ИЗМЕНЕНИЕ: в режиме сервера при пустой настройке «публикация» никакие состояния не будут подписаны. Раньше все штаты были подписаны\nДобавлена новая опция: все новые темы будут обрабатываться как бинарные.",
        "pt": "BREAKING CHANGE: no modo cliente, apenas os estados \"mqtt.X.*\" serão inscritos\nBREAKING CHANGE: no modo de servidor pela configuração \"publish\" vazia, nenhum estado será inscrito. No início todos os estados foram inscritos\nAdicionada nova opção: Todos os novos tópicos serão processados como binários",
        "nl": "BREAKING CHANGE: in client-modus worden alleen \"mqtt.X.*\"-statussen geabonneerd\nBREAKING CHANGE: in servermodus door lege \"publish\"-instelling worden geen staten geabonneerd. Vroeg waren alle staten ingeschreven\nNieuwe optie toegevoegd: alle nieuwe onderwerpen worden als binair verwerkt",
        "fr": "BREAKING CHANGE : en mode client, seuls les états \"mqtt.X.*\" seront souscrits\nBREAKING CHANGE : en mode serveur par un paramètre \"publier\" vide, aucun état ne sera souscrit. Au début, tous les États ont souscrit\nAjout d'une nouvelle option : tous les nouveaux sujets seront traités en binaire",
        "it": "BREAKING CHANGE: in modalità client verranno sottoscritti solo gli stati \"mqtt.X.*\".\nMODALITÀ DI ROTTURA: in modalità server con impostazione \"pubblica\" vuota non verrà sottoscritto alcuno stato. All'inizio tutti gli stati furono iscritti\nAggiunta nuova opzione: tutti i nuovi argomenti verranno elaborati come binari",
        "es": "CAMBIO IMPORTANTE: en modo cliente solo se suscribirán estados \"mqtt.X.*\"\nCAMBIO IMPORTANTE: en el modo de servidor mediante la configuración de \"publicar\" vacía, no se suscribirán estados. Temprano todos los estados fueron suscritos\nNueva opción agregada: todos los temas nuevos se procesarán como binarios",
        "pl": "KŁOPOTNA ZMIANA: w trybie klienta subskrybowane będą tylko stany \"mqtt.X.*\"\nPORAŻAJĄCA ZMIANA: w trybie serwera przy pustym ustawieniu „publikuj” żadne stany nie będą subskrybowane. Wcześnie wszystkie stany zostały zasubskrybowane\nDodano nową opcję: Wszystkie nowe tematy będą przetwarzane jako binarne",
        "zh-cn": "重大变化：在客户端模式下，只会订阅“mqtt.X.*”状态\nBREAKING CHANGE：在服务器模式下，通过空的“发布”设置将不会订阅任何状态。早期所有州都订阅了\n添加了新选项：所有新主题都将作为二进制处理"
      },
      "3.0.6": {
        "en": "Allows to use some special characters like # in client passwords\nCorrect handing of `QoS 2` messages\nImplement resend support of pubrec\nWhen resending a package set the dup flag as required by specs\nAdd more debug for special debug mode",
        "de": "Ermöglicht die Verwendung einiger Sonderzeichen wie # in Client-Passwörtern\nKorrekte Weiterleitung von `QoS 2`-Meldungen\nImplementieren Sie die Unterstützung für das erneute Senden von pubrec\nWenn Sie ein Paket erneut senden, setzen Sie das Dup-Flag wie von den Spezifikationen gefordert\nFügen Sie mehr Debug für den speziellen Debug-Modus hinzu",
        "ru": "Позволяет использовать некоторые специальные символы, такие как #, в паролях клиентов.\nПравильная обработка сообщений `QoS 2`\nРеализовать поддержку повторной отправки pubrec\nПри повторной отправке пакета установите флаг дублирования, как того требуют спецификации.\nДобавить больше отладки для специального режима отладки",
        "pt": "Permite usar alguns caracteres especiais como # em senhas de clientes\nEntrega correta de mensagens `QoS 2`\nImplemente o suporte de reenvio do pubrec\nAo reenviar um pacote, defina o sinalizador dup conforme exigido pelas especificações\nAdicione mais depuração para o modo de depuração especial",
        "nl": "Maakt het gebruik van speciale tekens zoals # in klantwachtwoorden mogelijk\nCorrecte afhandeling van `QoS 2`-berichten\nImplementeer opnieuw verzenden ondersteuning van pubrec\nStel bij het opnieuw verzenden van een pakket de dup-vlag in zoals vereist door de specificaties\nVoeg meer foutopsporing toe voor speciale foutopsporingsmodus",
        "fr": "Permet d'utiliser des caractères spéciaux comme # dans les mots de passe des clients\nGestion correcte des messages `QoS 2`\nImplémenter le support de renvoi de pubrec\nLors du renvoi d'un paquet, définissez l'indicateur de dup comme requis par les spécifications\nAjouter plus de débogage pour le mode de débogage spécial",
        "it": "Consente di utilizzare alcuni caratteri speciali come # nelle password dei client\nCorretta gestione dei messaggi `QoS 2`\nImplementare il supporto per l'invio di nuovo di pubrec\nQuando si invia nuovamente un pacchetto, impostare il flag dup come richiesto dalle specifiche\nAggiungi più debug per una modalità di debug speciale",
        "es": "Permite usar algunos caracteres especiales como # en las contraseñas de los clientes\nManejo correcto de mensajes `QoS 2`\nImplementar soporte de reenvío de pubrec\nAl reenviar un paquete, configure el indicador dup según lo requieran las especificaciones\nAgregue más depuración para el modo de depuración especial",
        "pl": "Pozwala na użycie niektórych znaków specjalnych, takich jak # w hasłach klientów\nPrawidłowa obsługa komunikatów `QoS 2`\nZaimplementuj obsługę ponownego wysyłania pubrec\nPodczas ponownego wysyłania pakietu ustaw flagę dup zgodnie z wymaganiami specyfikacji\nDodaj więcej debugowania dla specjalnego trybu debugowania",
        "zh-cn": "允许在客户端密码中使用一些特殊字符，例如 #\n正确处理“QoS 2”消息\n实现对 pubrec 的重发支持\n重新发送包时，按照规范的要求设置 dup 标志\n为特殊调试模式添加更多调试"
      },
      "3.0.5": {
        "en": "BREAKING CHANGE: password is now stored encrypted, and so must be set anew after update!",
        "de": "BREAKING CHANGE: Passwort wird jetzt verschlüsselt gespeichert und muss daher nach Update neu gesetzt werden!",
        "ru": "ВАЖНОЕ ИЗМЕНЕНИЕ: пароль теперь хранится в зашифрованном виде, поэтому после обновления его необходимо установить заново!",
        "pt": "BREAKING CHANGE: a senha agora é armazenada criptografada e, portanto, deve ser definida novamente após a atualização!",
        "nl": "BREKENDE VERANDERING: het wachtwoord wordt nu versleuteld opgeslagen en moet dus opnieuw worden ingesteld na de update!",
        "fr": "BREAKING CHANGE : le mot de passe est maintenant stocké crypté et doit donc être défini à nouveau après la mise à jour !",
        "it": "MODIFICA INTERNA: la password è ora memorizzata crittografata, quindi deve essere reimpostata dopo l'aggiornamento!",
        "es": "CAMBIO IMPORTANTE: ¡la contraseña ahora se almacena cifrada, por lo que debe configurarse de nuevo después de la actualización!",
        "pl": "ZŁAMANIE ZMIANY: hasło jest teraz przechowywane w postaci zaszyfrowanej, więc po aktualizacji należy je ustawić od nowa!",
        "zh-cn": "重大更改：密码现在以加密方式存储，因此必须在更新后重新设置！"
      }
    },
    "title": "MQTT Broker/Client",
    "titleLang": {
      "en": "MQTT Broker/Client",
      "de": "MQTT Broker/Client",
      "ru": "Брокер MQTT/Клиент",
      "pt": "MQTT Broker/Cliente",
      "nl": "MQTT-makelaar/klant",
      "fr": "Courtier MQTT/Client",
      "it": "Broker/Cliente MQTT",
      "es": "Agente MQTT/Cliente",
      "pl": "Broker/klient MQTT",
      "zh-cn": "MQTT经纪人/客户"
    },
    "desc": {
      "en": "This adapter allows to send and receive MQTT messages from ioBroker and to be a broker",
      "de": "Adapter ermöglicht eine Kommunikation mit dem MQTT broker und kann auch selbst ein broker/server sein",
      "ru": "Драйвер позволяет подключатся к MQTT брокерам, а также самому выступать в роли брокера",
      "pt": "Este adaptador permite enviar e receber mensagens MQTT da ioBroker e ser um corretor",
      "nl": "Met deze adapter kunt u MQTT-berichten van ioBroker verzenden en ontvangen en makelaar worden",
      "fr": "Cet adaptateur permet d'envoyer et de recevoir des messages MQTT de ioBroker et d'être un courtier",
      "it": "Questo adattatore consente di inviare e ricevere messaggi MQTT da ioBroker e di essere un broker",
      "es": "Este adaptador permite enviar y recibir mensajes MQTT de ioBroker y ser un intermediario",
      "pl": "Ten adapter umożliwia wysyłanie i odbieranie wiadomości MQTT od ioBroker i brokera",
      "zh-cn": "该适配器允许从ioBroker发送和接收MQTT消息并成为代理"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "docs": {
      "en": "docs/en/mqtt.md",
      "ru": "docs/ru/mqtt.md"
    },
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "compact": true,
    "messagebox": true,
    "readme": "https://github.com/ioBroker/ioBroker.mqtt/blob/master/README.md",
    "loglevel": "info",
    "icon": "mqtt.png",
    "materialize": true,
    "keywords": [
      "notification",
      "MQTT",
      "message"
    ],
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.mqtt/master/admin/mqtt.png",
    "type": "protocols",
    "plugins": {
      "sentry": {
        "dsn": "https://40b55da1fb50459eab397fe8291e75fe@sentry.iobroker.net/91"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=3.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.4.3"
      }
    ],
    "tier": 2,
    "connectionType": "local",
    "dataSource": "push",
    "adminUI": {
      "config": "json"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Re-enter the password after Update!",
          "de": "Passwort muss nach dem Update erneut eingegeben werden!",
          "ru": "Повторно введите пароль после обновления!",
          "pt": "Digite novamente a senha após Atualizar!",
          "nl": "Voer het wachtwoord opnieuw in na Update!",
          "fr": "Entrez à nouveau le mot de passe après la mise à jour !",
          "it": "Reinserire la password dopo l'aggiornamento!",
          "es": "Vuelva a ingresar la contraseña después de ¡Actualizar!",
          "pl": "Wprowadź hasło ponownie po aktualizacji!",
          "zh-cn": "更新后重新输入密码！"
        },
        "text": {
          "en": "After installing this update the password needs to be re-entered in the Instance-Settings!",
          "de": "Nach der Installation dieses Updates muss das Passwort in den Instanz-Einstellungen neu eingegeben werden!",
          "ru": "После установки этого обновления необходимо заново ввести пароль в Instance-Settings!",
          "pt": "Depois de instalar esta atualização, a senha precisa ser reinserida nas configurações da instância!",
          "nl": "Na het installeren van deze update moet het wachtwoord opnieuw worden ingevoerd in de Instance-Settings!",
          "fr": "Après avoir installé cette mise à jour, le mot de passe doit être ressaisi dans les paramètres de l'instance !",
          "it": "Dopo aver installato questo aggiornamento, è necessario reinserire la password nelle impostazioni dell'istanza!",
          "es": "¡Después de instalar esta actualización, la contraseña debe volver a ingresarse en la Configuración de instancia!",
          "pl": "Po zainstalowaniu tej aktualizacji hasło należy ponownie wprowadzić w ustawieniach instancji!",
          "zh-cn": "安装此更新后，需要在实例设置中重新输入密码！"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<4.0.0",
            "newVersion>=4.0.0"
          ]
        },
        "title": {
          "en": "Subscription behavior changed",
          "de": "Abonnementverhalten geändert",
          "ru": "Поведение подписки изменилось",
          "pt": "Comportamento de assinatura alterado",
          "nl": "Abonnementsgedrag gewijzigd",
          "fr": "Le comportement d'abonnement a changé",
          "it": "Il comportamento dell'abbonamento è cambiato",
          "es": "Comportamiento de suscripción cambiado",
          "pl": "Zmieniono zachowanie subskrypcji",
          "zh-cn": "订阅行为已更改"
        },
        "text": {
          "en": "In client mode only the own \"mqtt.X.*\" states will be subscribed. In server mode with an empty \"publish\" setting, no states will be subscribed.",
          "de": "Im Client-Modus werden nur die eigenen \"mqtt.X.*\"-Zustände abonniert. Im Server-Modus mit einer leeren „Veröffentlichen“-Einstellung werden keine Zustände abonniert.",
          "ru": "В режиме клиента будут подписаны только собственные состояния \"mqtt.X.*\". В режиме сервера с пустой настройкой «публикация» никакие состояния не будут подписаны.",
          "pt": "No modo cliente, apenas os próprios estados \"mqtt.X.*\" serão inscritos. No modo de servidor com uma configuração \"publicar\" vazia, nenhum estado será inscrito.",
          "nl": "In client-modus worden alleen de eigen \"mqtt.X.*\"-statussen geabonneerd. In servermodus met een lege \"publish\"-instelling, worden geen staten geabonneerd.",
          "fr": "En mode client, seuls les propres états \"mqtt.X.*\" seront souscrits. En mode serveur avec un paramètre \"publier\" vide, aucun état ne sera souscrit.",
          "it": "In modalità client verranno sottoscritti solo i propri stati \"mqtt.X.*\". In modalità server con un'impostazione \"pubblica\" vuota, nessuno stato verrà sottoscritto.",
          "es": "En modo cliente sólo se suscribirán los propios estados \"mqtt.X.*\". En el modo de servidor con una configuración de \"publicación\" vacía, no se suscribirá ningún estado.",
          "pl": "W trybie klienta subskrybowane będą tylko własne stany \"mqtt.X.*\". W trybie serwera z pustym ustawieniem „publikuj”, żadne stany nie będą subskrybowane.",
          "zh-cn": "在客户端模式下，只会订阅自己的“mqtt.X.*”状态。在“发布”设置为空的服务器模式下，不会订阅任何状态。"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "encryptedNative": [
    "pass"
  ],
  "protectedNative": [
    "pass"
  ],
  "native": {
    "type": "client",
    "clientId": "",
    "bind": "0.0.0.0",
    "port": 1883,
    "ssl": false,
    "rejectUnauthorized": true,
    "user": "",
    "pass": "",
    "url": "localhost",
    "patterns": "#",
    "onchange": true,
    "publishAllOnStart": true,
    "debug": false,
    "publish": "mqtt.0.*",
    "certPublic": "",
    "certPrivate": "",
    "certChained": "",
    "prefix": "",
    "forceCleanSession": "no",
    "sendAckToo": false,
    "sendStateObject": false,
    "webSocket": false,
    "maxTopicLength": 100,
    "publishOnSubscribe": true,
    "extraSet": false,
    "sendOnStartInterval": 2000,
    "sendInterval": 10,
    "keepalive": 1000,
    "reconnectPeriod": 10,
    "connectTimeout": 30,
    "persistent": false,
    "defaultQoS": 0,
    "retain": false,
    "retransmitInterval": 2000,
    "retransmitCount": 10,
    "storeClientsTime": 1440,
    "removePrefix": "",
    "ignoreNewObjects": false,
    "noRetain": false,
    "allBinaries": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "connected client for MQTT",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
